Input configuration
===================

Configuration is supplemented to MPULS via `.yaml` files. One session cna use only one configuration file.

The main setings are divided into several groups. The main groups are:
 - general settings
 - model settings
 - simulation settings
 - grid settings

-----------------



General settings
-----------------

```yaml

general_settings:
  output_dir: "output"                             
  output_format: "hdf5"                            
  output_summary_name: "stellar_profiles"          
  output_prefix: "test_2d_output_t"                
  mode: "testing"                                  
  dimension: 2                                     
  backend: "reference"                             
```
Here we provide the runtime mode, output folder etc. essential data. Currently used tags:

```yaml
output_prefix: "test_2d_output_t"
```
This describes the output name prefix of the output profiles.

```yaml
mode: "testing"
dimension: 2
```
The runtinme mode (only testing) and the number of the dimensions we are using.


```yaml
backend: "reference"
```
The backend the code should use. Currently the `reference` and `cuda` backends are available.
Other planned backends (can be): `native`, `multi-gpu`, `sycl`.

The `reference` backend is the slowest single-threaded implementation of the algorithms, it is advised to be used for testing purposes.


Model settings
--------------

This section describes what physical problem we want to solve, and what equation system (i.e. the model),
has to be solved. The block look like this:

```yaml

model:
  system_type: "Euler"
  initial_conditions:
    name: "Kelvin-Helmholtz"
    params: [1.4, -0.5, 0.5, 2., 1., 2.5, 0.01, 3.]
    # --- Some Example for Boundaries ---
  boundary_conditions:
    inner_boundary: "damping"                        # Some...
    outer_boundary: "reflexive"                      # ... example
```

### System type

The line
```yaml
system_type: "Euler"
```
Describes the equation system we want to solve. Currently implemented versions are `Euler` and `Scalar2D`.

### Intial conditions

```yaml
 initial_conditions:
    name: "Kelvin-Helmholtz"
    params: [1.4, -0.5, 0.5, 2., 1., 2.5, 0.01, 3.]
```
The block describes the initial model (`name`), and the starting parameters `params` given as an array.


Simulation settings
-------------------

The solvers main properties are defined here. This includes time integration, hyperbolic and parabolic
solver as well as additional solution filtering for stability.

```yaml
simulation:
  integrator:
    integrator_type: "SSP_RK2"                       # Another example input...
    time_step: "CFL_hyp"                             # Adaptive TimeStep Crit with CFL?
    delta_t: 0.1                                     # output timestep
    t_max: 10.                                       # Maximum simulation time
    initial_t: 0.0                                   # Starting simulation time
    cfl_number: 0.15                                 # the expected CFL number
  hyperbolic_solver:
    reconstruction: "piecewise_linear"                # The type of the solution reconstruction inside the cell. "can be piecewise_linear and piecewise_constant"
    limiter: "superbee"                               # Type of the flux limiter can be "vanleer", "minmod" and "superbee"
    flux_calculation: "local-lf"                      # Type of the flux calculation method
  diffusion_solver: "simple"                          # Unimplemented
  hyperdiffusion: true                               # Do we want to use the hyperdiffusion filter
  hyperdiffusivity_coeff: 0.15
```


### Time integration

```yaml
  integrator:
    integrator_type: "SSP_RK2"                       
    time_step: "CFL_hyp"                             # Adaptive TimeStep Crit with CFL?
    delta_t: 0.1                                     # output timestep
    t_max: 10.                                       # Maximum simulation time
    initial_t: 0.0                                   # Starting simulation time
    cfl_number: 0.15                                 # the expected CFL number
```
This node describes how the time integration is handled. First and foremost what solver is used. This is given by the `integrator_type` which can be:
 - `SSP_RK2` : 2nd order Strong Stability Preserving Runge-Kutta solver
 - `SSP_RK3` : 3rd order Strong Stability Preserving Runge-Kutta solver

later on, this is planned to be extended for SSP IMEX methods like SSP-IMEX(2,3,2) or SSP-IMEX(3,3,3), to
implicitely solve the parabolic part of the equations.

The node `time_step`, describes the adaptive time stepping method. Currently only the hyperbolic CFL number is implemented (`CFL_hyp`). Later a parabolic and/or adaptive CFL methods will be included.

The `delta_t` node is used to determine that at which timestep do we want to write out solution profile.
The `t_max` gives the maximum time in seconds. The `initial_t` is the starting time value. All three 
parameter is expecting for float values.

### Hyperbolic solver

The hyperbolic solver currently implemented with different versions of the semi-differnce Kurganov-Tadmor method. The key parameters are:

- `reconstruction` currently piecewise constant (`piecewise_constant`) and linear (`piecewise_linear`)
 are implemented
- `limiter` the flux limiter used in the reconstruction. Options are:
   + `vanleer` The Van Leer type limiter
   + `minmod` Minmod type limiter
   + `superbee` Superbee type limiter
- `flux_calculation` the final flux calculation method on the interface. Options are:
   + `local-lf` Local Lax-Friedrichs method also known as Rusanov scheme.
   + `upwind`  Simple upwind formulation.

Note: `upwind` calculation paired with `piecewise_linear` method can be be unstable due to low amount of
    artificial viscosity.


Stellar parameters
------------------
This is needed for the model builder in the 1D testing.

```yaml
stellar_parameters:
  stellar_mass: 2.0          # M_sun.     (optional) 
  luminosity: 41             # L_sun      (optional)
  t_eff: 5760                # K          (optional)
  metallicity: 0.02          # Z           (mandatory)
```

Grid Configuration
------------------

```yaml

grid:
  number_of_radial_grid_cells: 50
  radius_min: 10                                 
  radius_max: 14                                  
  scale: "logarithmic"                             # "linear" or "logarithmic"
  type: "uniform"
  number_of_theta_grid_cells: 50                   # Number of grid cells in theta direction
  size_of_theta_grid: 24                           # Size of the domain in theta direction in degrees
  number_of_phi_grid_cells: 1                      # Number of grid cells in phi direction
  size_of_phi_grid: 360                            # Size of the domain in phi direction in degrees
```

The main 2D parameters are the following:
 - `number_of_radial_grid_cells`: The number of radial cells.
 - `radius_min`: The starting radius.
 - `radius_max`: The radius coordinate of the topmost element.
 - `scale`: The radial buildup of the grid only used in 1D calculations (can be `linear` or `logarithmic`)
 - `type`: The method f the grid buildup (currently only `uniform` is available)
 - `number_of_theta_grid_cells`: The number of horizontal grid cells.
 - `size_of_theta_grid`: The opening angle of the simulation domain given in degrees.
 - `number_of_phi_grid_cells`: N/A
 - `size_of_phi_grid`: N/A

```{note}
The number of necessary ghost cells are determined by the different solvers. E.g., :class:PLM needs 2
```
